{
  "url":
    "https://www.homedepot.com/p/Rachael-Ray-Tools-and-Gadgets-Red-Lazy-Flexi-Turner-and-Scraping-Spoon-Set-47651/308689404",
  "title": "Tools and Gadgets Red Lazy Flexi Turner and Scraping Spoon Set",
  "brand": "Rachael Ray",
  "category": "mouthShovel",
  "price": 1918,
  "description":
    "Put some smart precision into your cooking with the Rachael Ray Tools and Gadgets Lazy Flexi Turner and Scraping Spoon Set. Rachael Ray knows all about putting more gain with less strain into cooking and serving, and her Lazy Tools bring that convenience to home cooks everywhere. The clever notch on these durable tools allow them to perch on pot and pan rims so drips and sauces land inside cookware instead of on counters, floors and stovetops. Lightweight, rigid nylon construction of the Flexi Turner head makes it a cinch to flip pancakes, slide eggs onto your plate, or turn a griddled sammy, and the scraping spoon features an innovative straight-edge tip for scraping up browned bits from a batch of Rach's Broken Spaghetti Meatballs -- fuhgetaboutit. Lazy Tools from Rachael Ray are designed to work like a champ and rest like a charm. Balance the turner on the side of a skillet when preparing red potatoes and green peppers for Sunday brunches, and youll always know right where it is. Ideal for use with nonstick interiors because they dont scratch or scrape, the nylon turner and spoon are heat safe to 400F and dishwasher safe for convenience. These colorful, clever kitchen tools make the perfect complement to other stylish, smart-designed kitchenware and cookware from the Rachael Ray collections. Get precise with your cooking with help from the ingenious, essential and easy-to-clean Rachael Ray Lazy Flexi Turner ans Scraping Spoon Set.Rachael Ray lazy tools are notched to rest on the edge of cookware so drips fall in the pan, not on the countertopRigid nylon tool heads are crafted for precision flipping and scraping; silicone handles are contoured for extra comfortIdeal for use with all types of cookware, including nonstickHeat safe to 400°F for ultimate versatilityDishwasher safe for easy and convenient cleanupQuality assurance guarantee",
  "imageUrl":
    "https://images.homedepot-static.com/productImages/94c52bb8-b0c0-46e0-a2d2-0ebf42e38b21/svn/rachael-ray-spatulas-47651-64_600.jpg",
  "quantity": 3
}
