{
  "url":
    "https://www.homedepot.com/p/GIR-Ultimate-Silicone-Orange-Spoon-GIRSNU204ORG/301437475",
  "title": "Ultimate Silicone Orange Spoon",
  "brand": "GIR",
  "category": "mouthShovel",
  "price": 1027,
  "description":
    "Brings a combination of the best features of a ladle, scoop, and spatula into an obsession-worthy spoon that's more than the sum of its parts. A deep bowl for stirring and serving, a graceful handle, and just enough flex at the edges. Unibody silicone construction, heat resistant to 550 F, easy to clean, dishwasher and nonstick safe, and nearly indestructible - it will not discolor, warp, melt, or chip. This solid silicone slotted spoon won't scratch or damage delicate cookware. Our proprietary fiberglass core provides better heat resistance and longer life than cheap iron and stainless steel cores, which heat up the handle and degrade silicone quality. The unibody design is super hygienic - no holes or seams for food/oils to get caught in, so no place for bacteria to grow. Dishwasher safe on any rack or extremely easy to clean by hand. Made to last forever in your kitchen and comes with a manufacturer's 100% Lifetime Satisfaction Guarantee, no questions asked. FDA + LFGB approved, BPA, BPS, and phthalate free. GIR started with a simple mission: to revolutionize the spatula. We knew that if we designed a product with carefully chosen materials, and uncompromising focus on quality, we would have something worth sharing with the world. Our \"Get It Right\" philosophy applies to a complete range of products that are beautiful, functional, and fun.A combination of the best features of a ladle, scoop, and spatula; a deep bowl for stirring, serving and just enough flex at the edgesThe platinum silicone is heat resistant up to 550°F and nonstick safeProprietary fiberglass core offers better heat resistance than metal cores; these won't get too hot to the touchUnibody design has no holes or seams, making it super hygienic and easy to clean; dishwasher safeManufacturer's 100% lifetime guarantee, made to last forever in your kitchen; BPA, BPS, and phthalate free",
  "imageUrl":
    "https://images.homedepot-static.com/productImages/67c7f270-a27f-4f6c-8532-bd2da115fb5e/svn/gir-spoons-ladles-girsnu204org-64_600.jpg",
  "quantity": 15
}
